STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_SerialPort_Client/STM32_WPAN/App/app_ble.c
        result = aci_gap_create_connection(
            0x0060, // LE_Scan_Interval (60 ms)
            0x0030, // LE_Scan_Window (30 ms)
            bleAppContext.deviceServerBdAddrType,
            &bleAppContext.a_deviceServerBdAddr[0],
            GAP_STATIC_RANDOM_ADDR, // Own_Address_Type: Random address
            CONN_INT_MS(20u), // Conn_Interval_Min
            CONN_INT_MS(100u), // Conn_Interval_Max
            0u, // Conn_Latency
            CONN_SUP_TIMEOUT_MS(1000u), // Supervision_Timeout
            CONN_CE_LENGTH_MS(20u), // Minimum_CE_Length
            CONN_CE_LENGTH_MS(20u)  // Maximum_CE_Length
        );

        if (result == BLE_STATUS_SUCCESS)
        {
            bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
            LOG_INFO_APP("  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
            UTIL_SEQ_WaitEvt(1u << CFG_EVENT_CONNECTION_COMPLETE);
            if(new_ConnHdl != 0u)
            {
                gatt_client_app.ConnHdl = new_ConnHdl;
                gatt_client_app.ConnOpcode = PEER_CONN_HANDLE_EVT;
                GATT_CLIENT_APP_Notification(&gatt_client_app);
                new_ConnHdl = 0u;
            }
        }
        else
        {
            LOG_INFO_APP("==>> GAP Create connection Failed , result: 0x%02x\n", result);
        }
    }

    return;
}


static void Scan_Request(void)
{
    tBleStatus result;
    
    Scan_Param_Phy_t scan_param_phy = {.Scan_Type = HCI_SCAN_TYPE_PASSIVE,   // 0x00: Passive, 0x01: Active
                                       .Scan_Interval = SCAN_INT_MS(500),    // Macro come prima, oppure valore diretto
                                       .Scan_Window = SCAN_WIN_MS(500)
                                       };
    
    if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
    {
        APP_BSP_LED_On(LED_BLUE);

        result = aci_gap_ext_start_scan(
            0x00,                        // Scan_Mode: Reserved, set to 0
            0x02,                        // Procedure: GAP_GENERAL_DISCOVERY_PROC
            GAP_STATIC_RANDOM_ADDR,      // Own_Address_Type: Random address
            0x01,                        // Filter_Duplicates
            0x0000,                      // Duration: 0 = scan until stopped
            0x0000,                      // Period: 0 = scan until stopped
            0x00,                        // Scanning_Filter_Policy: Accept all
            0x01,                        // Scanning_PHYs: 1M PHY
            &scan_param_phy              // Scan_Param_Phy: parametri per ogni PHY
        );

        if (result != BLE_STATUS_SUCCESS)
        {
            LOG_INFO_APP("aci_gap_ext_start_scan - fail, result: 0x%02X\n", result);
        }
        else
        {
            LOG_INFO_APP("==>> aci_gap_ext_start_scan - Success\n");
        }
    }

    return;
}


static void Central_security_request(void)
{
  tBleStatus status;
  status = aci_gap_send_pairing_req(bleAppContext.connectionHandle,
                                    0x00 // Force_Rebond: 0 = do not force, 1 = force pairing even if bonded
                                    );
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Pairing request cmd failure: 0x%02X\n", status);
  }
  else
  {
    LOG_INFO_APP("Pairing request cmd success\n");
  }

}

static void Central_conn_interv_update(void)
{
  tBleStatus status;
  uint32_t paramA, paramB, paramC, paramD, paramE, paramF;
  paramC = 0x0000;
  paramD = 0x01F4;

  if (bleAppContext.connIntervalFlag != 0)
  {
    bleAppContext.connIntervalFlag = 0;
    paramA = CONN_INT_MS(11.25);
    paramB = CONN_INT_MS(11.25);
    paramE = 0x00;
    paramF = CONN_CE_LENGTH_MS(11.25);
  }
  else
  {
    bleAppContext.connIntervalFlag = 1;
    paramA = CONN_INT_MS(26.25);
    paramB = CONN_INT_MS(26.25);
    paramE = 0x00;
    paramF = CONN_CE_LENGTH_MS(26.25);
  }
    
  status = aci_gap_start_connection_update(bleAppContext.connectionHandle,
                                           paramA,
                                           paramB,
                                           paramC,
                                           paramD,
                                           paramE,
                                           paramF);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("aci_gap_start_connection_update() Failed, status 0x%02X\n",status);
  }
  else
  {
    LOG_INFO_APP("aci_gap_start_connection_update(), Successfully\n");
  }

}

#if (CFG_BUTTON_SUPPORTED == 1)
void APP_BSP_Button1Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    UTIL_SEQ_SetTask(1<<CFG_TASK_START_SCAN_ID, CFG_SEQ_PRIO_0);
  }

  return;
}

void APP_BSP_Button2Action(void)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  else
  {
    LOG_INFO_APP("**SECURITY REQ \n");
    UTIL_SEQ_SetTask(1 << CFG_TASK_CENTRAL_SECURITY_REQ_ID, CFG_SEQ_PRIO_0);
  }
  
  return;
}

void APP_BSP_Button3Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
  }
  else
  {
    LOG_INFO_APP("**CONN INTERVAL TOGGLE\n");
    UTIL_SEQ_SetTask(1 << CFG_TASK_CENTRAL_CONN_INTERV_UPDATE_ID, CFG_SEQ_PRIO_0);
  }
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

/**
  * @brief Callback called by the BLE stack (from BleStack_Process() context)
  * to send an indication to the application. The indication is a BLE standard
  * packet that can be either an ACI/HCI event or an ACL data.
  * @param data: pointer to the data of the packet
  * @param length: length of the data of the packet
  * @param ext_data: pointer to the extended data
  * @param ext_length: extended data length
  * @retval Status of the operation
  */

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  /* USER CODE BEGIN BLECB_Indication */

  /* USER CODE END BLECB_Indication */

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    BLE_EVENTS_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_BLE_EVENTS,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &BLE_EVENTS_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
/* USER CODE END FD_WRAP_FUNCTIONS */
